In [5]:
import numpy as np
import pandas as pd

In [6]:
from numpy.random import randn

In [7]:
np.random.seed(10)

In [8]:
df = pd.DataFrame(randn(5,4),'A B C D E'.split(), 'W X Y Z'.split())

In [9]:
df

          W         X         Y         Z
A  1.331587  0.715279 -1.545400 -0.008384
B  0.621336 -0.720086  0.265512  0.108549
C  0.004291 -0.174600  0.433026  1.203037
D -0.965066  1.028274  0.228630  0.445138
E -1.136602  0.135137  1.484537 -1.079805

In [10]:
df['W']

A    1.331587
B    0.621336
C    0.004291
D   -0.965066
E   -1.136602
Name: W, dtype: float64

In [11]:
df['X']

A    0.715279
B   -0.720086
C   -0.174600
D    1.028274
E    0.135137
Name: X, dtype: float64

In [12]:
df['Y']

A   -1.545400
B    0.265512
C    0.433026
D    0.228630
E    1.484537
Name: Y, dtype: float64

In [13]:
df['Z']

A   -0.008384
B    0.108549
C    1.203037
D    0.445138
E   -1.079805
Name: Z, dtype: float64

In [14]:
df.W

A    1.331587
B    0.621336
C    0.004291
D   -0.965066
E   -1.136602
Name: W, dtype: float64

In [15]:
type(df['W'])

pandas.core.series.Series

In [16]:
type(df['Z'])

pandas.core.series.Series

In [17]:
type(df)

pandas.core.frame.DataFrame

In [18]:
df[['W','Y']]

          W         Y
A  1.331587 -1.545400
B  0.621336  0.265512
C  0.004291  0.433026
D -0.965066  0.228630
E -1.136602  1.484537

In [19]:
df[['Z','X']]

          Z         X
A -0.008384  0.715279
B  0.108549 -0.720086
C  1.203037 -0.174600
D  0.445138  1.028274
E -1.079805  0.135137

In [20]:
df['WX'] = df['W'] + df['X']

In [21]:
df

          W         X         Y         Z        WX
A  1.331587  0.715279 -1.545400 -0.008384  2.046865
B  0.621336 -0.720086  0.265512  0.108549 -0.098750
C  0.004291 -0.174600  0.433026  1.203037 -0.170309
D -0.965066  1.028274  0.228630  0.445138  0.063208
E -1.136602  0.135137  1.484537 -1.079805 -1.001465

In [22]:
df['YZ'] = df['Y'] + df['Z']

In [23]:
df

          W         X         Y         Z        WX        YZ
A  1.331587  0.715279 -1.545400 -0.008384  2.046865 -1.553784
B  0.621336 -0.720086  0.265512  0.108549 -0.098750  0.374060
C  0.004291 -0.174600  0.433026  1.203037 -0.170309  1.636064
D -0.965066  1.028274  0.228630  0.445138  0.063208  0.673768
E -1.136602  0.135137  1.484537 -1.079805 -1.001465  0.404732

In [24]:
df['sqrtX'] = df['X']**0.5

In [25]:
df

          W         X         Y         Z        WX        YZ     sqrtX
A  1.331587  0.715279 -1.545400 -0.008384  2.046865 -1.553784  0.845742
B  0.621336 -0.720086  0.265512  0.108549 -0.098750  0.374060       NaN
C  0.004291 -0.174600  0.433026  1.203037 -0.170309  1.636064       NaN
D -0.965066  1.028274  0.228630  0.445138  0.063208  0.673768  1.014038
E -1.136602  0.135137  1.484537 -1.079805 -1.001465  0.404732  0.367610

In [26]:
df.drop('sqrtX',axis=1)

          W         X         Y         Z        WX        YZ
A  1.331587  0.715279 -1.545400 -0.008384  2.046865 -1.553784
B  0.621336 -0.720086  0.265512  0.108549 -0.098750  0.374060
C  0.004291 -0.174600  0.433026  1.203037 -0.170309  1.636064
D -0.965066  1.028274  0.228630  0.445138  0.063208  0.673768
E -1.136602  0.135137  1.484537 -1.079805 -1.001465  0.404732

In [27]:
df

          W         X         Y         Z        WX        YZ     sqrtX
A  1.331587  0.715279 -1.545400 -0.008384  2.046865 -1.553784  0.845742
B  0.621336 -0.720086  0.265512  0.108549 -0.098750  0.374060       NaN
C  0.004291 -0.174600  0.433026  1.203037 -0.170309  1.636064       NaN
D -0.965066  1.028274  0.228630  0.445138  0.063208  0.673768  1.014038
E -1.136602  0.135137  1.484537 -1.079805 -1.001465  0.404732  0.367610

In [28]:
df.drop('sqrtX',axis=1,inplace=True)

In [29]:
df

          W         X         Y         Z        WX        YZ
A  1.331587  0.715279 -1.545400 -0.008384  2.046865 -1.553784
B  0.621336 -0.720086  0.265512  0.108549 -0.098750  0.374060
C  0.004291 -0.174600  0.433026  1.203037 -0.170309  1.636064
D -0.965066  1.028274  0.228630  0.445138  0.063208  0.673768
E -1.136602  0.135137  1.484537 -1.079805 -1.001465  0.404732

In [30]:
df.drop('E',axis=0)

          W         X         Y         Z        WX        YZ
A  1.331587  0.715279 -1.545400 -0.008384  2.046865 -1.553784
B  0.621336 -0.720086  0.265512  0.108549 -0.098750  0.374060
C  0.004291 -0.174600  0.433026  1.203037 -0.170309  1.636064
D -0.965066  1.028274  0.228630  0.445138  0.063208  0.673768

In [31]:
df

          W         X         Y         Z        WX        YZ
A  1.331587  0.715279 -1.545400 -0.008384  2.046865 -1.553784
B  0.621336 -0.720086  0.265512  0.108549 -0.098750  0.374060
C  0.004291 -0.174600  0.433026  1.203037 -0.170309  1.636064
D -0.965066  1.028274  0.228630  0.445138  0.063208  0.673768
E -1.136602  0.135137  1.484537 -1.079805 -1.001465  0.404732

In [32]:
df.shape

(5, 6)

In [33]:
df['W']

A    1.331587
B    0.621336
C    0.004291
D   -0.965066
E   -1.136602
Name: W, dtype: float64

In [34]:
df[['W','Z']]

          W         Z
A  1.331587 -0.008384
B  0.621336  0.108549
C  0.004291  1.203037
D -0.965066  0.445138
E -1.136602 -1.079805

In [35]:
df.loc['A']

W     1.331587
X     0.715279
Y    -1.545400
Z    -0.008384
WX    2.046865
YZ   -1.553784
Name: A, dtype: float64

In [36]:
df.loc['B']

W     0.621336
X    -0.720086
Y     0.265512
Z     0.108549
WX   -0.098750
YZ    0.374060
Name: B, dtype: float64

In [37]:
df.loc[['A','B','C']]

          W         X         Y         Z        WX        YZ
A  1.331587  0.715279 -1.545400 -0.008384  2.046865 -1.553784
B  0.621336 -0.720086  0.265512  0.108549 -0.098750  0.374060
C  0.004291 -0.174600  0.433026  1.203037 -0.170309  1.636064

In [38]:
df.loc['C']

W     0.004291
X    -0.174600
Y     0.433026
Z     1.203037
WX   -0.170309
YZ    1.636064
Name: C, dtype: float64

In [39]:
df.loc[['A','C'],['X','Z']]*100

           X           Z
A  71.527897   -0.838385
C -17.460021  120.303737

In [40]:
df

          W         X         Y         Z        WX        YZ
A  1.331587  0.715279 -1.545400 -0.008384  2.046865 -1.553784
B  0.621336 -0.720086  0.265512  0.108549 -0.098750  0.374060
C  0.004291 -0.174600  0.433026  1.203037 -0.170309  1.636064
D -0.965066  1.028274  0.228630  0.445138  0.063208  0.673768
E -1.136602  0.135137  1.484537 -1.079805 -1.001465  0.404732

In [41]:
df > 0

       W      X      Y      Z     WX     YZ
A   True   True  False  False   True  False
B   True  False   True   True  False   True
C   True  False   True   True  False   True
D  False   True   True   True   True   True
E  False   True   True  False  False   True

In [42]:
df[df>0]

          W         X         Y         Z        WX        YZ
A  1.331587  0.715279       NaN       NaN  2.046865       NaN
B  0.621336       NaN  0.265512  0.108549       NaN  0.374060
C  0.004291       NaN  0.433026  1.203037       NaN  1.636064
D       NaN  1.028274  0.228630  0.445138  0.063208  0.673768
E       NaN  0.135137  1.484537       NaN       NaN  0.404732

In [43]:
df[df<0]

          W         X       Y         Z        WX        YZ
A       NaN       NaN -1.5454 -0.008384       NaN -1.553784
B       NaN -0.720086     NaN       NaN -0.098750       NaN
C       NaN -0.174600     NaN       NaN -0.170309       NaN
D -0.965066       NaN     NaN       NaN       NaN       NaN
E -1.136602       NaN     NaN -1.079805 -1.001465       NaN

In [44]:
df[df%3 ==1]

    W   X   Y   Z  WX  YZ
A NaN NaN NaN NaN NaN NaN
B NaN NaN NaN NaN NaN NaN
C NaN NaN NaN NaN NaN NaN
D NaN NaN NaN NaN NaN NaN
E NaN NaN NaN NaN NaN NaN

In [45]:
df[df['W']>0]

          W         X         Y         Z        WX        YZ
A  1.331587  0.715279 -1.545400 -0.008384  2.046865 -1.553784
B  0.621336 -0.720086  0.265512  0.108549 -0.098750  0.374060
C  0.004291 -0.174600  0.433026  1.203037 -0.170309  1.636064

In [46]:
df['W'][df['W']>0]

A    1.331587
B    0.621336
C    0.004291
Name: W, dtype: float64

In [47]:
df[df['W']>0]['Y']

A   -1.545400
B    0.265512
C    0.433026
Name: Y, dtype: float64

In [48]:
df

          W         X         Y         Z        WX        YZ
A  1.331587  0.715279 -1.545400 -0.008384  2.046865 -1.553784
B  0.621336 -0.720086  0.265512  0.108549 -0.098750  0.374060
C  0.004291 -0.174600  0.433026  1.203037 -0.170309  1.636064
D -0.965066  1.028274  0.228630  0.445138  0.063208  0.673768
E -1.136602  0.135137  1.484537 -1.079805 -1.001465  0.404732

In [49]:
df[df['W']<0]['W']

D   -0.965066
E   -1.136602
Name: W, dtype: float64

In [50]:
df[df['W']>0][['X','Y']]

          X         Y
A  0.715279 -1.545400
B -0.720086  0.265512
C -0.174600  0.433026

In [51]:
df[(df['W']>0)&(df['Y']<0)]

          W         X       Y         Z        WX        YZ
A  1.331587  0.715279 -1.5454 -0.008384  2.046865 -1.553784

In [52]:
df[(df['W']>0)&(df['Y']<0)][['W','Y','WX']]

          W       Y        WX
A  1.331587 -1.5454  2.046865

In [53]:
df.reset_index()

  index         W         X         Y         Z        WX        YZ
0     A  1.331587  0.715279 -1.545400 -0.008384  2.046865 -1.553784
1     B  0.621336 -0.720086  0.265512  0.108549 -0.098750  0.374060
2     C  0.004291 -0.174600  0.433026  1.203037 -0.170309  1.636064
3     D -0.965066  1.028274  0.228630  0.445138  0.063208  0.673768
4     E -1.136602  0.135137  1.484537 -1.079805 -1.001465  0.404732

In [54]:
newind = 'CA TX NY FL OR'.split()

In [55]:
newind

['CA', 'TX', 'NY', 'FL', 'OR']

In [56]:
df['States'] = newind

In [57]:
df

          W         X         Y         Z        WX        YZ States
A  1.331587  0.715279 -1.545400 -0.008384  2.046865 -1.553784     CA
B  0.621336 -0.720086  0.265512  0.108549 -0.098750  0.374060     TX
C  0.004291 -0.174600  0.433026  1.203037 -0.170309  1.636064     NY
D -0.965066  1.028274  0.228630  0.445138  0.063208  0.673768     FL
E -1.136602  0.135137  1.484537 -1.079805 -1.001465  0.404732     OR

In [58]:
df.set_index('States',inplace=True)

In [59]:
df.drop('YZ',axis=1)

               W         X         Y         Z        WX
States
CA      1.331587  0.715279 -1.545400 -0.008384  2.046865
TX      0.621336 -0.720086  0.265512  0.108549 -0.098750
NY      0.004291 -0.174600  0.433026  1.203037 -0.170309
FL     -0.965066  1.028274  0.228630  0.445138  0.063208
OR     -1.136602  0.135137  1.484537 -1.079805 -1.001465

In [60]:
df

               W         X         Y         Z        WX        YZ
States
CA      1.331587  0.715279 -1.545400 -0.008384  2.046865 -1.553784
TX      0.621336 -0.720086  0.265512  0.108549 -0.098750  0.374060
NY      0.004291 -0.174600  0.433026  1.203037 -0.170309  1.636064
FL     -0.965066  1.028274  0.228630  0.445138  0.063208  0.673768
OR     -1.136602  0.135137  1.484537 -1.079805 -1.001465  0.404732

In [61]:
df['X*Y'] = df['X']*df['Y']

In [62]:
df

               W         X         Y         Z        WX        YZ       X*Y
States
CA      1.331587  0.715279 -1.545400 -0.008384  2.046865 -1.553784 -1.105392
TX      0.621336 -0.720086  0.265512  0.108549 -0.098750  0.374060 -0.191191
NY      0.004291 -0.174600  0.433026  1.203037 -0.170309  1.636064 -0.075606
FL     -0.965066  1.028274  0.228630  0.445138  0.063208  0.673768  0.235094
OR     -1.136602  0.135137  1.484537 -1.079805 -1.001465  0.404732  0.200616

In [63]:
df.insert(7,'Names',['A','B','C','D','E'], True)

In [64]:
df

,W,X,Y,Z,WX,YZ,X*Y,Names
States,,,,,,,,
CA,1.331587,0.715279,-1.545400,-0.008384,2.046865,-1.553784,-1.105392,A
TX,0.621336,-0.720086,0.265512,0.108549,-0.098750,0.374060,-0.191191,B
NY,0.004291,-0.174600,0.433026,1.203037,-0.170309,1.636064,-0.075606,C
FL,-0.965066,1.028274,0.228630,0.445138,0.063208,0.673768,0.235094,D
OR,-1.136602,0.135137,1.484537,-1.079805,-1.001465,0.404732,0.200616,E

In [65]:
df.loc['NY']

W        0.00429143
X           -0.1746
Y          0.433026
Z           1.20304
WX        -0.170309
YZ          1.63606
X*Y      -0.0756065
Names             C
Name: NY, dtype: object

In [66]:
df.loc[['NY','TX']]

,W,X,Y,Z,WX,YZ,X*Y,Names
States,,,,,,,,
NY,0.004291,-0.174600,0.433026,1.203037,-0.170309,1.636064,-0.075606,C
TX,0.621336,-0.720086,0.265512,0.108549,-0.098750,0.374060,-0.191191,B

In [68]:
df.iloc[3]

W        -0.965066
X          1.02827
Y          0.22863
Z         0.445138
WX       0.0632084
YZ        0.673768
X*Y       0.235094
Names            D
Name: FL, dtype: object

In [79]:
df.drop('YZ',axis=1,inplace=True)

In [80]:
df

               W         X         Y         Z        WX       X*Y Names
States
CA      1.331587  0.715279 -1.545400 -0.008384  2.046865 -1.105392     A
TX      0.621336 -0.720086  0.265512  0.108549 -0.098750 -0.191191     B
NY      0.004291 -0.174600  0.433026  1.203037 -0.170309 -0.075606     C
FL     -0.965066  1.028274  0.228630  0.445138  0.063208  0.235094     D
OR     -1.136602  0.135137  1.484537 -1.079805 -1.001465  0.200616     E

In [82]:
df.loc['CA','W']

1.331586504129518

In [89]:
df.loc[['CA','FL'],['W','Y']]

               W        Y
States
CA      1.331587 -1.54540
FL     -0.965066  0.22863

# conditional selection

In [93]:
df.drop(['Names'],axis=1)

               W         X         Y         Z        WX       X*Y
States
CA      1.331587  0.715279 -1.545400 -0.008384  2.046865 -1.105392
TX      0.621336 -0.720086  0.265512  0.108549 -0.098750 -0.191191
NY      0.004291 -0.174600  0.433026  1.203037 -0.170309 -0.075606
FL     -0.965066  1.028274  0.228630  0.445138  0.063208  0.235094
OR     -1.136602  0.135137  1.484537 -1.079805 -1.001465  0.200616

In [94]:
df

               W         X         Y         Z        WX       X*Y Names
States
CA      1.331587  0.715279 -1.545400 -0.008384  2.046865 -1.105392     A
TX      0.621336 -0.720086  0.265512  0.108549 -0.098750 -0.191191     B
NY      0.004291 -0.174600  0.433026  1.203037 -0.170309 -0.075606     C
FL     -0.965066  1.028274  0.228630  0.445138  0.063208  0.235094     D
OR     -1.136602  0.135137  1.484537 -1.079805 -1.001465  0.200616     E

In [95]:
df.drop(['Names'],axis=1,inplace=True)

In [96]:
df

               W         X         Y         Z        WX       X*Y
States
CA      1.331587  0.715279 -1.545400 -0.008384  2.046865 -1.105392
TX      0.621336 -0.720086  0.265512  0.108549 -0.098750 -0.191191
NY      0.004291 -0.174600  0.433026  1.203037 -0.170309 -0.075606
FL     -0.965066  1.028274  0.228630  0.445138  0.063208  0.235094
OR     -1.136602  0.135137  1.484537 -1.079805 -1.001465  0.200616

In [98]:
booldf = df > 0

In [101]:
booldf

            W      X      Y      Z     WX    X*Y
States
CA       True   True  False  False   True  False
TX       True  False   True   True  False  False
NY       True  False   True   True  False  False
FL      False   True   True   True   True   True
OR      False   True   True  False  False   True

## df[booldf] is equal to df[df>0]

In [100]:
df[booldf]

               W         X         Y         Z        WX       X*Y
States
CA      1.331587  0.715279       NaN       NaN  2.046865       NaN
TX      0.621336       NaN  0.265512  0.108549       NaN       NaN
NY      0.004291       NaN  0.433026  1.203037       NaN       NaN
FL           NaN  1.028274  0.228630  0.445138  0.063208  0.235094
OR           NaN  0.135137  1.484537       NaN       NaN  0.200616

In [102]:
df['W']>0

States
CA     True
TX     True
NY     True
FL    False
OR    False
Name: W, dtype: bool

In [103]:
df[df['W']>0]

               W         X         Y         Z        WX       X*Y
States
CA      1.331587  0.715279 -1.545400 -0.008384  2.046865 -1.105392
TX      0.621336 -0.720086  0.265512  0.108549 -0.098750 -0.191191
NY      0.004291 -0.174600  0.433026  1.203037 -0.170309 -0.075606

In [104]:
df

               W         X         Y         Z        WX       X*Y
States
CA      1.331587  0.715279 -1.545400 -0.008384  2.046865 -1.105392
TX      0.621336 -0.720086  0.265512  0.108549 -0.098750 -0.191191
NY      0.004291 -0.174600  0.433026  1.203037 -0.170309 -0.075606
FL     -0.965066  1.028274  0.228630  0.445138  0.063208  0.235094
OR     -1.136602  0.135137  1.484537 -1.079805 -1.001465  0.200616

In [105]:
df['Z']<0

States
CA     True
TX    False
NY    False
FL    False
OR     True
Name: Z, dtype: bool

In [106]:
df[df['Z']<0]

               W         X         Y         Z        WX       X*Y
States
CA      1.331587  0.715279 -1.545400 -0.008384  2.046865 -1.105392
OR     -1.136602  0.135137  1.484537 -1.079805 -1.001465  0.200616

In [127]:
df[df['Z']<0]['Z']

States
CA   -0.008384
OR   -1.079805
Name: Z, dtype: float64

In [136]:
boolser = df['W']>0
result = df[boolser]
mycols = ['Y','X']
result[mycols]

               Y         X
States
CA     -1.545400  0.715279
TX      0.265512 -0.720086
NY      0.433026 -0.174600

In [137]:
result

               W         X         Y         Z        WX       X*Y
States
CA      1.331587  0.715279 -1.545400 -0.008384  2.046865 -1.105392
TX      0.621336 -0.720086  0.265512  0.108549 -0.098750 -0.191191
NY      0.004291 -0.174600  0.433026  1.203037 -0.170309 -0.075606

In [138]:
df.reset_index()

  States         W         X         Y         Z        WX       X*Y
0     CA  1.331587  0.715279 -1.545400 -0.008384  2.046865 -1.105392
1     TX  0.621336 -0.720086  0.265512  0.108549 -0.098750 -0.191191
2     NY  0.004291 -0.174600  0.433026  1.203037 -0.170309 -0.075606
3     FL -0.965066  1.028274  0.228630  0.445138  0.063208  0.235094
4     OR -1.136602  0.135137  1.484537 -1.079805 -1.001465  0.200616

In [139]:
df

               W         X         Y         Z        WX       X*Y
States
CA      1.331587  0.715279 -1.545400 -0.008384  2.046865 -1.105392
TX      0.621336 -0.720086  0.265512  0.108549 -0.098750 -0.191191
NY      0.004291 -0.174600  0.433026  1.203037 -0.170309 -0.075606
FL     -0.965066  1.028274  0.228630  0.445138  0.063208  0.235094
OR     -1.136602  0.135137  1.484537 -1.079805 -1.001465  0.200616

## dataframes part 3

In [142]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [143]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [141]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [145]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [146]:
df

             A         B
G1 1  0.132708 -0.476142
   2  1.308473  0.195013
   3  0.400210 -0.337632
G2 1  1.256472 -0.731970
   2  0.660232 -0.350872
   3 -0.939433 -0.489337

In [148]:
df.loc['G1']

          A         B
1  0.132708 -0.476142
2  1.308473  0.195013
3  0.400210 -0.337632

In [152]:
df.loc['G2']

          A         B
1  1.256472 -0.731970
2  0.660232 -0.350872
3 -0.939433 -0.489337

In [153]:
df.index.names

FrozenList([None, None])

In [154]:
df.index.names = ['Groups','Num']

In [156]:
df

                   A         B
Groups Num
G1     1    0.132708 -0.476142
       2    1.308473  0.195013
       3    0.400210 -0.337632
G2     1    1.256472 -0.731970
       2    0.660232 -0.350872
       3   -0.939433 -0.489337

In [157]:
df.loc['G2']

            A         B
Num
1    1.256472 -0.731970
2    0.660232 -0.350872
3   -0.939433 -0.489337

In [158]:
df.loc['G1'].loc[3]

A    0.400210
B   -0.337632
Name: 3, dtype: float64

In [159]:
df.loc['G1'].loc[2].loc['A']

1.3084730808634777

In [161]:
df.loc['G1']

            A         B
Num
1    0.132708 -0.476142
2    1.308473  0.195013
3    0.400210 -0.337632

In [162]:
df.xs('G1')

            A         B
Num
1    0.132708 -0.476142
2    1.308473  0.195013
3    0.400210 -0.337632

In [163]:
df.xs(1,level='Num')

               A         B
Groups
G1      0.132708 -0.476142
G2      1.256472 -0.731970

In [164]:
df.xs(3,level='Num')

               A         B
Groups
G1      0.400210 -0.337632
G2     -0.939433 -0.489337